<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
<head> <meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />

<title>История развития криптографии. Развитие шифров </title>
<style type="text/css">
<!--
.стиль3 {
	font-size: 13pt;
	font-family: Tahoma, Arial, Helvetica, sans-serif;
}
-->
</style>
</head>

<a href=index.html><img src=" o.jpg" align="right" > </a>
<br><br><br><br>
<p align="center">  <font color="000000" face= "tahoma" size="5" >
 <b> <BODY text="# " link="000000" vlink="000000" alink="878787"> <font color= "000000" face= "Tahoma" size="5" > |<a href=shifri.html> Развитие шифров </a>    |    <a href=prib.html> Изобретения  </a>   |   <a href=ist.html>Немного о... </a>| <a href=index.html>На главную..>></a>|</b></b> 
</font> </body> 
</p>
<hr>
<br>

<body background="фонег.jpg" text="000000" bgcolor="# ">
<div align="center"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;3"><strong>Двухбуквенный шифр Фрэнсиса Бэкона</strong><br>
&#1042; 17 &#1074;&#1077;&#1082;&#1077; &#1060;&#1088;&#1101;&#1085;&#1089;&#1080;&#1089; &#1041;&#1101;&#1082;&#1086;&#1085; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &quot;&#1076;&#1074;&#1091;&#1093;&#1073;&#1091;&#1082;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1096;&#1080;&#1092;&#1088;&quot;. &#1054;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081;: &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1073;&#1091;&#1082;&#1074;&#1077; &#1083;&#1072;&#1090;&#1080;&#1085;&#1089;&#1082;&#1086;&#1075;&#1086; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1072; &#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1072; &#1080;&#1079; &#1087;&#1103;&#1090;&#1080; &#1073;&#1091;&#1082;&#1074; a &#1080; b. </span>
</div>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;3"><img src= " бэкон.jpg" width="813" height="197"><br>
&#1053;&#1077;&#1089;&#1083;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1090;&#1100; &#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1074; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1089;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1053;&#1091; &#1080; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086; &quot;&#1073;&#1091;&#1082;&#1074;&#1099; a &#1080; b&quot; &#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1076;&#1074;&#1091;&#1093; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1084;&#1099;&#1093; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;. &#1052;&#1099; &#1073;&#1099; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1083;&#1080; 0 &#1080; 1.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;3">&#1050;&#1072;&#1082; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1076;&#1074;&#1072; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1084;&#1099;&#1093; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;?</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;3">&#1041;&#1101;&#1082;&#1086;&#1085; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1080;&#1083; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;. </p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;3"><img src=" бэкон1.jpg" width="997" height="328"></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;3">&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1085;&#1077; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1088;&#1086;&#1089;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1075;&#1083;&#1072;&#1079;&#1072;, &#1072; &#1085;&#1072; &#1084;&#1077;&#1083;&#1082;&#1080;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080;, &#1080; &#1079;&#1072;&#1082;&#1086;&#1085;&#1086;&#1084;&#1077;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1093; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1057;&#1084;&#1099;&#1089;&#1083; &#1078;&#1077; &quot;&#1103;&#1074;&#1085;&#1086;&#1075;&#1086;&quot; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1074;&#1072;&#1078;&#1077;&#1085; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077;. &#1057;&#1077;&#1081;&#1095;&#1072;&#1089; &#1101;&#1090;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1077;&#1075;&#1072;&#1085;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1103;.</p>
<br>
  <p align="center"> 
 <font  face= "Tahoma" size="6"  > <a href="бэкон.swf" title="Проверь себя" target="_blank">Проверь себя</a> </font>
<br>
</p>
<hr>
<br> <font> </font> </body>
</html>
