<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
<head> <meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />

<title>История развития криптографии. Развитие шифров </title>

</head>

<a href=index.html><img src=" o.jpg" align="right" > </a>
<br><br><br><br>
<p align="center">
 <b> <BODY text="000000" link="000000" vlink="000000" alink="878787"> <font color= "000000" face= "Tahoma" size="5" > |<a href=shifri.html> Развитие шифров </a>    |    <a href=prib.html> Изобретения  </a>   |   <a href=ist.html>Немного о... </a>| <a href=index.html>На главную..>></a>|</b></b> 
</font> </body> 
</p>
<hr>
<br>

<body background="фонег.jpg"  text="000000" bgcolor=" ">


<p align="left">  <font color="000000" face= "tahoma" size="3" >История криптографии насчитывает около 4 тысяч лет.  <br>
В качестве основного критерия периодизации криптографии возможно использовать технологические характеристики используемых методов шифрования. <br>
<p align="center">
<style type="text/css">
<!--
.стиль1 {font-family: Tahoma, Arial, Helvetica, sans-serif}
.стиль2 {
	color: #FFFFFF;
	font-style: italic;
	font-weight: bold;
}
-->
</style>
<table width="200" border="2" class="&#1089;&#1090;&#1080;&#1083;&#1100;1">
  <tr bgcolor="#000000">
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;</span> </th>
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076; </span></th>
    <th scope="col"><div align="center"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1058;&#1088;&#1077;&#1090;&#1080;&#1081; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076; </span></div></th>
    <th scope="col"><p class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1063;&#1077;&#1090;&#1074;&#1105;&#1088;&#1090;&#1099;&#1081; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076; </p>
      <p>&nbsp;</p></th>
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1057;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1080;</span> </th>
  </tr>
  <tr>
    <th scope="col">(&#1087;&#1088;&#1080;&#1073;&#1083;&#1080;&#1079;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089; 3-&#1075;&#1086; &#1090;&#1099;&#1089;&#1103;&#1095;&#1077;&#1083;&#1077;&#1090;&#1080;&#1103; &#1076;&#1086; &#1085;.&#1101;.) &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1075;&#1086;&#1089;&#1087;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; &#1084;&#1086;&#1085;&#1086;&#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1099;&#1093; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074; (&#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &ndash; &#1079;&#1072;&#1084;&#1077;&#1085;&#1072; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1072; <br>
&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1086;&#1084; &#1095;&#1077;&#1088;&#1077;&#1079; &#1079;&#1072;&#1084;&#1077;&#1085;&#1091; &#1073;&#1091;&#1082;&#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1073;&#1091;&#1082;&#1074;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;&#1084;&#1080;).</th>
    <th scope="col">(&#1093;&#1088;&#1086;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1088;&#1072;&#1084;&#1082;&#1080; &ndash; &#1089; IX &#1074;&#1077;&#1082;&#1072; &#1085;&#1072; &#1041;&#1083;&#1080;&#1078;&#1085;&#1077;&#1084; &#1042;&#1086;&#1089;&#1090;&#1086;&#1082;&#1077; <br>
(&#1040;&#1083;-&#1050;&#1080;&#1085;&#1076;&#1080;) &#1080; &#1089; XV &#1074;&#1077;&#1082;&#1072; &#1074; &#1045;&#1074;&#1088;&#1086;&#1087;&#1077; (&#1051;&#1077;&#1086;&#1085; &#1041;&#1072;&#1090;&#1090;&#1080;&#1089;&#1090;&#1072; &#1040;&#1083;&#1100;&#1073;&#1077;&#1088;&#1090;&#1080;) &ndash; &#1076;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; XX &#1074;&#1077;&#1082;&#1072;) &#1086;&#1079;&#1085;&#1072;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1086;&#1073;&#1080;&#1093;&#1086;&#1076; &#1087;&#1086;&#1083;&#1080;&#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1099;&#1093; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;. </th>
    <th scope="col">(&#1089; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1080; &#1076;&#1086; &#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1099; XX &#1074;&#1077;&#1082;&#1072;) <br>
&#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1083;&#1100;&#1097;&#1080;&#1082;&#1086;&#1074;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1083;&#1086;&#1089;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1080;&#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1099;&#1093; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;. </th>
    <th scope="col">&ndash; &#1089; &#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1099; &#1076;&#1086; 70-&#1093; &#1075;&#1086;&#1076;&#1086;&#1074; XX &#1074;&#1077;&#1082;&#1072; &ndash; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1082; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1080;. &#1042; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1064;&#1077;&#1085;&#1085;&#1086;&#1085;&#1072; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1090;&#1088;&#1086;&#1075;&#1080;&#1077; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; <br>
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1101;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1080;, &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1054;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1101;&#1090;&#1072;&#1087;&#1086;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1096;&#1080;&#1092;&#1088;&#1072; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1077;&#1075;&#1086; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; <br>
&#1082; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1084; &#1072;&#1090;&#1072;&#1082;&#1072;&#1084; &ndash; &#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1086;&#1084;&#1091; &#1080; &#1076;&#1080;&#1092;&#1092;&#1077;&#1088;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1091;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1076;&#1086; 1975 &#1075;&#1086;&#1076;&#1072; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1103; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; &laquo;&#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081;&raquo;, &#1080;&#1083;&#1080; &#1078;&#1077;, <br>
&#1073;&#1086;&#1083;&#1077;&#1077; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;, &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1077;&#1081; &#1089; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1084; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;.</th>
    <th scope="col">(&#1089; &#1082;&#1086;&#1085;&#1094;&#1072; 1970-&#1093; &#1075;&#1086;&#1076;&#1086;&#1074; &#1087;&#1086; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;) &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1088;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1077;&#1084; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &ndash; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1103; <br>
      &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;. &#1045;&#1105; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1084;&#1077;&#1085;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080;, &#1085;&#1086; &#1080; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1096;&#1080;&#1088;&#1086;&#1082;&#1080;&#1084; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1080; &#1076;&#1083;&#1103; <br>
    &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1095;&#1072;&#1089;&#1090;&#1085;&#1099;&#1084;&#1080; &#1083;&#1080;&#1094;&#1072;&#1084;&#1080; (&#1074; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1077; &#1101;&#1087;&#1086;&#1093;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1080; &#1073;&#1099;&#1083;&#1086; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1088;&#1077;&#1088;&#1086;&#1075;&#1072;&#1090;&#1080;&#1074;&#1086;&#1081; &#1075;&#1086;&#1089;&#1091;&#1076;&#1072;&#1088;&#1089;&#1090;&#1074;&#1072;).</th>
  </tr>
</table>

</p>
 Правовое регулирование использования криптографии частными лицами в разных странах сильно различается – от разрешения до полного запрета. <br>
Современная криптография образует отдельное научное направление на стыке математики и информатики – работы в этой области публикуются в научных журналах,  <br>
организуются регулярные конференции. Практическое применение криптографии стало неотъемлемой частью жизни современного общества – её используют в таких  <br>
отраслях как электронная коммерция, электронный документооборот (включая цифровые подписи), телекоммуникации и других. </font> </p>

 <br>
 <p align="left">
<u> <H3><b><font color="000000" face= "Tahoma" size="3" > Криптография в Древнем мире </u> </b> </H3></font>  </p> 
 </font>
 <p align="left">  <font color="000000" face= "tahoma" size="3" >Имеются свидетельства, что криптография, как техника защиты текста,  <br>
 возникла вместе с письменностью, что способы тайного письма были известны уже древним цивилизациям Индии, Египта и Месопотамии. <br>
 В древнеиндийских текстах среди 64-х искусств названы способы изменения текста, некоторые из них можно отнести к криптографическим.  <br>
 Автор таблички с рецептом для изготовления глазури для гончарных изделий из Месопотамии использовал редкие обозначения, пропускал буквы, <br>
 а имена заменял на цифры, чтобы скрыть написанное.  <br>
Первым упоминанием об использовании криптографии принято считать использование специальных иероглифов около 3900 лет назад в Древнем Египте.  <br>
Хотя целью было не затруднить чтение текста – скорее наоборот, с помощью необычности и загадочности привлечь <br>
 внимание читателя и прославить вельможу Хнумхотепа Второго (англ. Khnumhotep II).  <br>
 В дальнейшем встречаются различные упоминания об использовании криптографии, большая часть относится к использованию в военном деле.<br>
 </font> </p>
  <p align="left">
<u> <H3><b><font color="000000" face= "Tahoma" size="3" >Тайнописи </u> </b> </H3></font>  </p> 
 </font>
 <p align="left">  <font color="000000" face= "tahoma" size="3" >Кроме примитивных шифров в истории использовался и другой <br>
 подход – полная замена одного алфавита (например, кириллицы) на другой (например, греческий). Не имея ключа,<br>
 сопоставляющего исходный и используемый алфавиты, прочитать надпись было невозможно. <br>
 Кроме этого использовались специальные техники записи символов алфавита таким образом, чтобы затруднить его чтение.<br>
 Примером такой техники являются <b>«вязанные руны»</b>, когда руны записываются таким образом, что отдельные их элементы (например, вертикальные черты) совпадают. <br>
 Подобные системы часто использовались жрецами Северо-Западной Европы вплоть до позднего Средневековья.<br>
Множество вариантов тайнописи использовалось и на Руси. Среди них и простые моноалфавитные шифры (простая литорея, письмо в квадратах),<br>
 замена алфавита – тайнопись глаголицей, тайнопись греческой азбукой, а также особые приёмы письма, например, монокондил.<br>
 Наиболее ранние тексты с использованием тайнописи относятся к XII веку.<br>
 Существует мнение, что в более поздний период тайнопись использовалась для иконографии, например,<br>
 при написания иконы XIV века <b>«Донская Богоматерь»</b>. Согласно другой точке зрения, буквенный ряд является лишь шрифтовым декором,<br>
 который был широко распространён как в древнерусской, так и, например, в византийской иконописи.<br>
 </font> </p>
 <u> <H3><b><font color="000000" face= "Tahoma" size="3" >Криптография арабского мира </u> </b> </H3></font>  </p> 
 </font>
 <p align="left">  <font color="000000" face= "tahoma" size="3" >В период расцвета арабских государств (8 век н.э.)<br>
 криптография получила новое развитие. Слово <b>«шифр»</b> арабского происхождения, так же как и слово <b>«цифра»</b>.<br>
 В 855 году появляется <b>«Книга о большом стремлении человека разгадать загадки древней письменности»</b>,<br>
 в которой приводятся описания систем шифров, в том числе и с применением нескольких шифралфавитов. <br>
 В 1412 году издается 14-томная энциклопедия, содержащая обзор всех научных сведений-<b>«Шауба аль-Аша»</b>. <br>
 Составитель ее Шехаб аль Кашканди. В данной энциклопедии содержится раздел о криптографии, в котором <br>
 приводятся описания всех известных способов шифрования. В этом разделе имеется упоминание о криптоанализе системы шифра,<br>
 который основан на частотных характеристиках открытого и шифрованного текста. Приводится частота встречаемости букв арабского языка<br>
 на основе изучения  текста Корана. <br>
Что касается математики  арабского мира, то следует упомянуть следующие выдающиеся достижения. <br>
Сочинение Мухаммеда бен Муса аль-Хорезми (9 век) по правилам арифметики в позиционной системе<br>
 счисления, от названия которого появились два термина <b>«алгебра»</b> и <b>«алгоритм»</b>. <br>
 Трактат по тригонометрическим функциям Аль-Баттани (9 век). Вычисление числа <b>«пи»</b> с 17 десятичными знаками (ок.1427) аль Каши, сотрудником Улугбека. <br>
<br>
 </font> </p>
 <u> <H3><b><font color="000000" face= "Tahoma" size="3" >Криптография в эпоху Возрождения (XIV-VVI вв.) </u> </b> </H3></font>  </p> 
 </font>
 <p align="left">  <font color="000000" face= "tahoma" size="3" >До эпохи Возрождения имеется мало сведений о применяемых шифрах.  <br>
 Известен ряд значковых шифров, при котором буквы открытого текста заменяются на специальные знаки.  <br>
 Таким является шифр Карла Великого (780-814 г.). Известен так называемый <b>«еврейский шифр»</b>, в котором замена букв <br>
 осуществляется по подстановке, в которой нижняя строка образуется так: алфавит разбивается на две половины.  <br>
 Буквы второй половины пишутся под буквами первой половины в обратном порядке. Аналогично поступают с остальными буквами. <br>
В эпоху Возрождения в итальянских городах-государствах стали расцветать науки и ремесла. Шифры применяются не только  <br>
государственной или церковной властью, но и учеными для защиты приоритета научных открытий (Галилей).   <br>
В 14 веке появляется книга Чикко Симонетти, сотрудника канцелярии папской курии. В этой книге описаны шифры замены,  <br>
в которых гласным буквам ставятся в соответствие несколько знаков с целью выравнивания частот букв в шифртексте. <br>
 Дано описание лозунгового шифра, в котором замена букв определяется так: под алфавитом пишутся различные буквы лозунга  <br>
 в порядке появления, а затем буквы, не появившиеся в лозунге. В 15 веке появляется книга Габриэля де Лавинда,  <br>
 секретаря Папы Клементия ХII, <b>«Трактат о шифрах»</b>, в которой дается описание шифра пропорциональной замены.  <br>
 Шифр обеспечивает замену букв несколькими символами, пропорционально встречаемости букв в открытом тексте.  <br>
 Дается рекомендация заменять имена, должности, географические названия специальными знаками.В этот период <br>
 в Милане применяется шифр, названный <b>«Миланский ключ»</b>, представляющий собой значковый шифр пропорциональной замены. <br>
В 1466 году Леон Альберти, знаменитый архитектор и философ представил трактат о шифрах в папскую канцелярию. <br>
  В трактате рассматриваются различные способы шифрования, в том числе маскировка открытого текста в некотором  <br>
  вспомогательном тексте. Работа завершается собственным шифром, который он назвал <b>«шифр, достойный королей»</b>.  <br>
  Это был многоалфавитный шифр, реализованный в виде шифровального диска. <br>
Суть заключается в том, что в данном шифре используется несколько замен в соответствии с ключом. <br>
 Позднее Альберти изобрел код с перешифровкой. Данное изобретение значительно опередило свое время, <br>
 поскольку данный тип шифра стал применяться в странах  Европы лишь 400 лет спустя.   <br>
В 1518 году в развитии криптографии был сделан новый шаг благодаря появлению в германии первой <br>
печатной книги по криптографии. Аббат Иоганнес Тритемий, настоятель монастыря в Вюрцбурге, написал книгу  <br>
<b>«Полиграфия»</b>, в которой дается описание ряда шифров. Один из них развивает идею многоалфавитной замены. <br>
 Шифрование осуществляется так: Заготавливается таблица замены, в которой первая строка есть алфавит,  <br>
 вторая строка есть алфавит, сдвинутый на один шаг и т.д.  При шифровании первая буква открытого текста <br>
 заменяется на букву, стоящую в первой строке, вторая буква – на букву, стоящую во второй строке и т.д.   <br>
 В 1553 году в Италии вышла небольшая книга <b>«Шифр синьора Белазо»</b>. Об авторе Джованни Белазо  известно мало. <br>
 Его вклад заключается в следующем. Он предложил использовать слово или группу слов, назвав это <b>«паролем»</b>, <br>
 выписывая его над (под) открытым текстом. Буква пароля означает номер применяемой замены к букве открытого текста.  <br>
 В начале 16 века Маттео Арженти, криптограф папской канцелярии изобрел код, представляющий собой шифр замены, <br>
 в котором заменяются буквы, слоги, слова и целые фразы. Необходимым количеством словарных величин в коде считалось 1200. <br>
 В это же время появляется и числовой код. <br>
   Следующий шаг  в развитии криптографии был сделан Джованни Порта,  <br>
   известным итальянским естествоиспытателем. В 1563 году он написал книгу  <br>
   <b>«О тайной переписке»</b>, в которой приводится описание всех известных систем шифров. <br>
   Дается также описание биграммного шифра, в котором осуществляется замена пар букв. <br>
   Порта предвосхитил то, что называют <b>«методом вероятного слова»</b> и  приводит примеры  <br>
   списков вероятных слов из различных областей. Примерно в то же время  итальянский математик и <br>
   философ  Джероламо Кардано, автор  многочисленных чниг по различным вопросам написал книгу <b>«О тонкостях»</b>,  <br>
   в которой имеется часть, посвященная криптографии. Его вклад содержит два предложения. Первое-использовать  <br>
   открытый текст в качестве ключа. Второе- он предложил шифр, называемый ныне <b>«Решетка Кадано»</b>. Кроме данных  <br>
   предложений Кардано дает <b>«доказательства»</b> стойкости шифров, основанные на подсчете числа ключей. <br>
В том же 16 веке был сделан еще существенный шаг в развитии криптографии. Блез Виженер, французский посол в Риме, <br>
 познакомился там с трудами по криптографии и в 1585 году написал книгу <b>«Трактат о шифрах»</b>, в которой он излагает основы криптографии.  <br>
 Ему принадлежит мысль <b>«Все вещи в мире представляют собой шифр. Вся природа является просто шифром и секретным письмом»</b>.  <br>
 Эту мысль повторил позднее Блез Паскаль и в наше время Норберт Винер. Предложение Виженера во многом развивает идею Кардано  <br>
 о применении открытого или шифрованного текста в качестве ключа. <br>
   Прогресс в математике в этот период характеризуется  трудами Леонардо Фибоначчи, <br>
   в которых излагается арифметика, алгебра и геометрия. Для вычислений используется  <br>
   сходимость геометрической прогрессии. Н. Орем установил расходимость гармонического ряда, <br>
   строгое доказательство этого появится только в 17 веке. Кардано при решении  уравнений третьей <br>
   степени вводит отрицательные и мнимые корни и устанавливает известную <b>«формулу Кардано»</b>.  <br>
   Алгебра получает развитие у Ф.Виета, который установил связь коэффициентов алгебраических  <br>
   уравнений и корней (формула Виета). Он же начал использовать буквенные обозначения   <br>
   для коэффициентов уравнений, до него это использовалось лишь для корней. Ф. Виет привлекался  <br>
   к дешифровальной работе при дворе Генриха IV и успешно дешифровал переписку испанского короля Филиппа II. <br>
   Отметим, что великий ученый и художник эпохи Возрождения Леонардо да Винчи (1452-1519) владел криптографией <br>
   и пользовался ею, в частности, в своих рукописях.  <br>

   <br>
    <a href=история.html> Далее..» </a><br> 
<br>
 </font> </p>
 <hr>
  <br><br>
 
  </body> 
</html>