<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
<head> <meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />

<title>История развития криптографии. Развитие шифров </title>
<style type="text/css">
<!--
.стиль6 {font-family: Tahoma, Arial, Helvetica, sans-serif}
.стиль7 {
	font-size: 12pt;
	font-weight: bold;
}
.стиль8 {font-size: medium}
.стиль9 {font-size: 12pt}
-->
</style>
</head>

<a href=index.html><img src=" o.jpg" align="right" > </a>
<br><br><br><br>
<p align="center">  <font color="000000" face= "tahoma" size="5" >
 <b> <BODY text="# " link="000000" vlink="000000" alink="878787"> <font color= "000000" face= "Tahoma" size="5" > |<a href=shifri.html> Развитие шифров </a>    |    <a href=prib.html> Изобретения  </a>   |   <a href=ist.html>Немного о... </a>| <a href=index.html>На главную..>></a>|</b></b> 
</font> </body> 
</p>
<hr>
<br>

<body background="фонег.jpg" text="000000" bgcolor="# ">
<div align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;6">  
  <p class="&#1089;&#1090;&#1080;&#1083;&#1100;7">&#1064;&#1080;&#1092;&#1088; &#1042;&#1080;&#1078;&#1077;&#1085;&#1077;&#1088;&#1072;</p>
  <p class="&#1089;&#1090;&#1080;&#1083;&#1100;9"> &#1045;&#1097;&#1077; &#1086;&#1076;&#1085;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086;&#1077; &#1091;&#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1085;&#1086;&#1075;&#1086;&#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;, &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074; &#1080;&#1076;&#1077;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1083;&#1102;&#1095;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1078;&#1077; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1080;&#1090; &#1044;&#1078;&#1077;&#1088;&#1086;&#1083;&#1072;&#1084;&#1086; &#1050;&#1072;&#1088;&#1076;&#1072;&#1085;&#1086; &#1080; &#1041;&#1083;&#1077;&#1079;&#1091; &#1076;&#1077; &#1042;&#1080;&#1078;&#1077;&#1085;&#1077;&#1088;&#1091;. &#1058;&#1072;&#1082;&#1086;&#1081; &#1096;&#1080;&#1092;&#1088; &#1073;&#1099;&#1083; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085; &#1089;&#1072;&#1084;&#1086;&#1082;&#1083;&#1102;&#1095;&#1086;&#1084;. &#1042; &#1082;&#1085;&#1080;&#1075;&#1077; &#1042;&#1080;&#1078;&#1077;&#1085;&#1077;&#1088;&#1072; &laquo;&#1058;&#1088;&#1072;&#1082;&#1090;&#1072;&#1090; &#1086; &#1096;&#1080;&#1092;&#1088;&#1072;&#1093;&raquo; &#1089;&#1072;&#1084;&#1086;&#1082;&#1083;&#1102;&#1095; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;. &#1042; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1079;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1091; &#1073;&#1088;&#1072;&#1083;&#1072;&#1089;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1058;&#1088;&#1080;&#1090;&#1077;&#1084;&#1080;&#1103; &#1089; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1082; &#1085;&#1077;&#1081; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1072;&#1084;&#1080; &#1074; &#1080;&#1093; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;. &#1055;&#1086;&#1079;&#1078;&#1077; &#1090;&#1072;&#1082;&#1072;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1089;&#1090;&#1072;&#1083;&#1072; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;&#1081; &#1042;&#1080;&#1078;&#1077;&#1085;&#1077;&#1088;&#1072;. &#1055;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1074; &#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1042;&#1080;&#1078;&#1077;&#1085;&#1077;&#1088;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1094;&#1080;&#1082;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072;&#1077;&#1084;&#1099;&#1093; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1086;&#1074;, &#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084; &#1089;&#1084;&#1077;&#1096;&#1072;&#1085;&#1085;&#1099;&#1084; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1086;&#1084;.  &#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1086;&#1084; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1072; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094; &mdash; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1086;&#1084; &#1082;&#1083;&#1102;&#1095;&#1072;. &#1044;&#1083;&#1103; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; (To = t1t2&hellip;) &#1042;&#1080;&#1078;&#1077;&#1085;&#1077;&#1088; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1083; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; (&Gamma;) &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1072;&#1084;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; (To) &#1089; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082; &#1085;&#1077;&#1084;&#1091; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1073;&#1091;&#1082;&#1074;&#1099; (to) &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1081; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1102; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1102;. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1073;&#1091;&#1082;&#1074; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1076;&#1088;&#1091;&#1075; &#1087;&#1086;&#1076; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;:  </p>
  <p class="&#1089;&#1090;&#1080;&#1083;&#1100;9"><strong>&Gamma; = tot1t2&hellip;ti&minus;1&hellip;<br>
  To = t1t2t3&hellip;ti&hellip;<br>
    ______________<br>
    T&#1096; = s1s2s3&hellip;si&hellip;  </strong></p>
  <p class="&#1089;&#1090;&#1080;&#1083;&#1100;9">&#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072; &#1073;&#1091;&#1082;&#1074;, &#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1093; &#1076;&#1088;&#1091;&#1075; &#1087;&#1086;&#1076; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1074; &Gamma; &#1080; &#1058;o, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083;&#1072;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082; &#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;, &#1085;&#1072; &#1087;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1082; si &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; (T&#1096;). &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1092;&#1088;&#1072;&#1079;&#1072; <strong>HUNC CAVETO VIRUM</strong>&hellip;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1093;, &#1080; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1073;&#1091;&#1082;&#1074;&#1072; &#1056; &#1076;&#1072;&#1102;&#1090; &#1096;&#1080;&#1092;&#1088;&#1090;&#1077;&#1082;&#1089;&#1090; <strong>YCHP ECUWZH IDAMG.</strong>  &#1042;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1077; &#1042;&#1080;&#1078;&#1077;&#1085;&#1077;&#1088; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1083; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;:</p>
  <p class="&#1089;&#1090;&#1080;&#1083;&#1100;9"><strong> &Gamma; = sos1s2&hellip;si&minus;1&hellip;<br>
  To = t1t2t3&hellip;ti&hellip;<br>
    ______________<br>
    T&#1096; = s1s2s3&hellip;si&hellip; </strong></p>
  <p class="&#1089;&#1090;&#1080;&#1083;&#1100;8"><strong><img src=" виженер.gif" width="485" height="417"></strong></p>
  <p class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1057;&#1072;&#1084;&#1086;&#1082;&#1083;&#1102;&#1095; &#1042;&#1080;&#1078;&#1077;&#1085;&#1077;&#1088;&#1072; &#1073;&#1099;&#1083; &#1085;&#1077;&#1079;&#1072;&#1089;&#1083;&#1091;&#1078;&#1077;&#1085;&#1085;&#1086; &#1079;&#1072;&#1073;&#1099;&#1090; &#1085;&#1072; &#1076;&#1086;&#1083;&#1075;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1072; &#1087;&#1086;&#1076; &#1096;&#1080;&#1092;&#1088;&#1086;&#1084; &#1042;&#1080;&#1078;&#1077;&#1085;&#1077;&#1088;&#1072; &#1076;&#1086; &#1089;&#1080;&#1093; &#1087;&#1086;&#1088; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1089;&#1072;&#1084;&#1099;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1089; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1084; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084; &#1089;&#1083;&#1086;&#1074;&#1086;&#1084; &#1080; &#1089; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;&#1081;, &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1081; &#1080;&#1079; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1086;&#1074;.</p>
</div>

<br>
<p align="center"> 
 <font  face= "Tahoma" size="6"  > <a href="виженер.swf" title="Проверь себя" target="_blank">Проверь себя</a> </font>
<br>
</p>
<hr>
<br>
  </body> 
</html>