<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
<head> <meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />

<title>История развития криптографии. Развитие шифров </title>
<style type="text/css">
<!--
.стиль8 {font-family: Tahoma, Arial, Helvetica, sans-serif}
-->
</style>
</head>
<a href=index.html><img src=" o.jpg" align="right" > </a>
<br><br><br><br>
<p align="center">  <b>  <BODY text=" " link="000000" vlink="000000" alink="878787"> <font color= "000000" face= "Tahoma" size="5" > |<a href=shifri.html> Развитие шифров </a>    |    <a href=prib.html> Изобретения  </a>   |   <a href=ist.html>Немного о... </a>| <a href=index.html>На главную..>></a>|</b></b> 
</font> </body> 
</p>
<hr>
<br>

<body background="фонег.jpg"  text="000000" bgcolor=" "> 
<img src="file:///D|/&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;/&#1075;&#1072;&#1091;&#1089;&#1089;.jpg" width="200" height="256" align="left" border="2">
<div align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">
  <p><strong>&#1064;&#1080;&#1092;&#1088;&#1099; &#1080; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082;&#1080;</strong></p>
  <p>&#1061;&#1086;&#1076;&#1103;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077; &#1074;&#1099;&#1089;&#1082;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086; &#1087;&#1086;&#1074;&#1086;&#1076;&#1091; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082;&#1086;&#1074; &#1080; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1086;&#1074;. &#1071;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1083;&#1080; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082;&#1080; &#1083;&#1091;&#1095;&#1096;&#1080;&#1084;&#1080; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1072;&#1084;&#1080;? </p>
</div>

<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1047;&#1072;&#1084;&#1077;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1077;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1082;&#1088;&#1091;&#1087;&#1085;&#1077;&#1081;&#1096;&#1080;&#1077; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082;&#1080;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1058;&#1072;&#1082;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1077;&#1083;&#1080;&#1082;&#1080;&#1081; &#1085;&#1077;&#1084;&#1077;&#1094;&#1082;&#1080;&#1081; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082; &#1050;.&#1043;&#1072;&#1091;&#1089;&#1089; &#1085;&#1077; &#1086;&#1073;&#1086;&#1096;&#1077;&#1083; &#1089;&#1074;&#1086;&#1080;&#1084; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;&#1084; &#1080; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1102;. &#1053;&#1077; &#1073;&#1091;&#1076;&#1091;&#1095;&#1080; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084; &#1089; &#1077;&#1077; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1077;&#1081;, &#1086;&#1085; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &laquo;&#1085;&#1077;&#1076;&#1077;&#1096;&#1080;&#1092;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081;&raquo; &#1087;&#1086; &#1077;&#1075;&#1086; &#1084;&#1085;&#1077;&#1085;&#1080;&#1102; &#1096;&#1080;&#1092;&#1088;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091; &#1103;&#1074;&#1083;&#1103;&#1083;&#1089;&#1103; &#1088;&#1072;&#1085;&#1077;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1077;&#1090;&#1077;&#1085;&#1085;&#1099;&#1084; &#1096;&#1080;&#1092;&#1088;&#1086;&#1084; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1079;&#1072;&#1084;&#1077;&#1085;&#1099; &#1080;, &#1082;&#1072;&#1082; &#1086;&#1082;&#1072;&#1079;&#1072;&#1083;&#1086;&#1089;&#1100;, &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1076;&#1077;&#1096;&#1080;&#1092;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1056;&#1072;&#1085;&#1077;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1081; &#1074;&#1077;&#1083;&#1080;&#1082;&#1080;&#1081; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082; - &#1051;. &#1069;&#1081;&#1083;&#1077;&#1088; - &laquo;&#1080;&#1079;&#1086;&#1073;&#1088;&#1077;&#1083; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1081; &#1096;&#1080;&#1092;&#1088; &#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1095;&#1080;&#1090;&#1072;&#1083; &#1077;&#1075;&#1086; &#1085;&#1077;&#1076;&#1077;&#1096;&#1080;&#1092;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084;, &#1093;&#1086;&#1090;&#1103; &#1077;&#1075;&#1086; &#1076;&#1088;&#1091;&#1075; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082; X. &#1043;&#1086;&#1083;&#1100;&#1073;&#1072;&#1093; &#1074; &#1101;&#1090;&#1086; &#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1076;&#1077;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1099;&#1074;&#1072;&#1083; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1080;&#1083;&#1100;&#1085;&#1099;&#1077; &#1096;&#1080;&#1092;&#1088;&#1099;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1055;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;&#1090; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1076;&#1072;&#1078;&#1077; &#1074;&#1077;&#1083;&#1080;&#1082;&#1080;&#1077; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082;&#1080; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1089;&#1103; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1084;&#1080; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1072;&#1084;&#1080;. &#1069;&#1090;&#1086; &#1089;&#1087;&#1088;&#1072;&#1074;&#1077;&#1076;&#1083;&#1080;&#1074;&#1086; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1074; &#1085;&#1072;&#1096;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1103; &#1089;&#1090;&#1072;&#1083;&#1072; &#1089;&#1077;&#1088;&#1100;&#1077;&#1079;&#1085;&#1086;&#1081; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1085;&#1072;&#1091;&#1082;&#1086;&#1081;.</p>
<font face="tahoma" size="3"><a href=омоф.html>* Описание шифра пропорциональной замены</a>
<br><br>
<hr>
<br>
</body> 
</html>