<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
<head> <meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />

<title>История развития криптографии. Развитие шифров </title>
<style type="text/css">
<!--
.стиль6 {
	font-size: large;
	font-weight: bold;
	font-family: Tahoma, Arial, Helvetica, sans-serif;
}
.стиль8 {font-family: Tahoma, Arial, Helvetica, sans-serif}
-->
</style>
</head>
<a href=index.html><img src=" o.jpg" align="right" > </a>
<br><br><br><br>
<p align="center">  <b>  <BODY text=" " link="000000" vlink="000000" alink="878787"> <font color= "000000" face= "Tahoma" size="5" > |<a href=shifri.html> Развитие шифров </a>    |    <a href=prib.html> Изобретения  </a>   |   <a href=ist.html>Немного о... </a>| <a href=index.html>На главную..>></a>|</b></b> 
</font> </body> 
</p>
<hr>
<br>

<body background="фонег.jpg"  text="000000" bgcolor=" "> 
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;6"><b>&laquo;&#1076;&#1077;&#1079;&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1076; &#1096;&#1080;&#1092;&#1088;&#1086;&#1084;&raquo;</b></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1041;&#1099;&#1083; &#1074; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1092;&#1088;&#1072;&#1085;&#1094;&#1091;&#1079;&#1099;, &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1086;&#1089;&#1086;&#1079;&#1085;&#1072;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1091;&#1090;&#1077;&#1095;&#1082;&#1072; &#1076;&#1080;&#1087;&#1083;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1090;&#1103;&#1078;&#1077;&#1083;&#1099;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1103;&#1084; &#1076;&#1083;&#1103; &#1075;&#1086;&#1089;&#1091;&#1076;&#1072;&#1088;&#1089;&#1090;&#1074;&#1072;. &#1057;&#1088;&#1077;&#1076;&#1080; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1099;&#1093; &#1080;&#1084;&#1080; &#1084;&#1077;&#1088; &#1079;&#1072;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;. &#1047;&#1085;&#1072;&#1103;, &#1095;&#1090;&#1086; &#1072;&#1085;&#1075;&#1083;&#1080;&#1095;&#1072;&#1085;&#1077; &#1076;&#1077;&#1096;&#1080;&#1092;&#1088;&#1091;&#1102;&#1090; &#1080;&#1093; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;&#1085;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1089;&#1082;&#1091;, &#1086;&#1085;&#1080; &#1085;&#1072;&#1095;&#1072;&#1083;&#1080; <b>&laquo;&#1087;&#1086;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;&raquo;</b> &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1085;&#1072;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1077; &#1076;&#1077;&#1079;&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1087;&#1086;&#1076; &#1074;&#1080;&#1076;&#1086;&#1084; <b>&laquo;&#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1086;&#1081;&raquo;</b> &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1076;&#1080;&#1087;&#1083;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1087;&#1086;&#1095;&#1090;&#1099;. &#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1083;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1082;&#1072;&#1085;&#1072;&#1083;&#1072;&#1084; &#1089;&#1074;&#1103;&#1079;&#1080;, &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1093;&#1074;&#1072;&#1090;&#1072; &#1072;&#1085;&#1075;&#1083;&#1080;&#1095;&#1072;&#1085;&#1072;&#1084;&#1080;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1042; &#1085;&#1072;&#1096;&#1080; &#1076;&#1085;&#1080; &#1080;&#1075;&#1088;&#1091; &#1074; &#1076;&#1077;&#1079;&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1087;&#1086;&#1076; &#1096;&#1080;&#1092;&#1088;&#1086;&#1084; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1083; &#1076;&#1088;&#1072;&#1084;&#1072;&#1090;&#1091;&#1088;&#1075; &#1055;&#1080;&#1090;&#1077;&#1088; &#1059;&#1089;&#1090;&#1080;&#1085;&#1086;&#1074; &#1074; &#1089;&#1074;&#1086;&#1077;&#1081; &#1087;&#1100;&#1077;&#1089;&#1077; <b>&laquo;&#1056;&#1086;&#1084;&#1072;&#1085;&#1086;&#1074; &#1080; &#1046;&#1102;&#1083;&#1100;&#1077;&#1090;&#1090;&#1072;&raquo;</b> (&#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074; &#1053;&#1100;&#1102;-&#1049;&#1086;&#1088;&#1082;&#1077; &#1074; 1957 &#1075;&#1086;&#1076;&#1091;). &#1042;&#1086;&#1090; &#1089;&#1094;&#1077;&#1085;&#1072; &#1080;&#1079; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1072;&#1082;&#1090;&#1072;. </p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1083;&#1080;&#1094;&#1072;: - &#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1083;, &#1087;&#1088;&#1077;&#1079;&#1080;&#1076;&#1077;&#1085;&#1090; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1086;&#1075;&#1086; &#1075;&#1086;&#1089;&#1091;&#1076;&#1072;&#1088;&#1089;&#1090;&#1074;&#1072; &#1074; &#1045;&#1074;&#1088;&#1086;&#1087;&#1077;; - &#1052;&#1086;&#1091;&#1083;&#1079;&#1091;&#1086;&#1088;&#1090;, &#1072;&#1084;&#1077;&#1088;&#1080;&#1082;&#1072;&#1085;&#1089;&#1082;&#1080;&#1081; &#1087;&#1086;&#1089;&#1086;&#1083; &#1074; &#1101;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1077;; - &#1056;&#1086;&#1084;&#1072;&#1085;&#1086;&#1074;, &#1089;&#1086;&#1074;&#1077;&#1090;&#1089;&#1082;&#1080;&#1081; &#1087;&#1086;&#1089;&#1086;&#1083;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1044;&#1086;&#1095;&#1100; &#1052;&#1086;&#1091;&#1083;&#1079;&#1091;&#1086;&#1088;&#1090;&#1072; (&#1046;&#1102;&#1083;&#1100;&#1077;&#1090;&#1090;&#1072;) &#1080; &#1089;&#1099;&#1085; &#1056;&#1086;&#1084;&#1072;&#1085;&#1086;&#1074;&#1072; &#1083;&#1102;&#1073;&#1103;&#1090; &#1076;&#1088;&#1091;&#1075; &#1076;&#1088;&#1091;&#1075;&#1072; &#1080; &#1076;&#1077;&#1083;&#1103;&#1090;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1077;&#1084;&#1077;&#1081;&#1085;&#1099;&#1084;&#1080; &#1090;&#1072;&#1081;&#1085;&#1072;&#1084;&#1080;. &#1057;&#1094;&#1077;&#1085;&#1072; &#1074; &#1087;&#1086;&#1089;&#1086;&#1083;&#1100;&#1089;&#1090;&#1074;&#1077; &#1057;&#1064;&#1040;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1083;: <b>&laquo;&#1050;&#1089;&#1090;&#1072;&#1090;&#1080;, &#1074;&#1099; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1077; &#1079;&#1085;&#1072;&#1102;&#1090; &#1074;&#1072;&#1096; &#1096;&#1080;&#1092;&#1088;?&raquo;</b></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1052;&#1086;&#1091;&#1083;&#1079;&#1091;&#1086;&#1088;&#1090;: <b>&laquo;&#1052;&#1099; &#1079;&#1085;&#1072;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1079;&#1085;&#1072;&#1102;&#1090; &#1085;&#1072;&#1096; &#1096;&#1080;&#1092;&#1088;, &#1085;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1084; &#1080;&#1084; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1093;&#1086;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1080; &#1091;&#1079;&#1085;&#1072;&#1083;&#1080;&raquo;</b>.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1083; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1089;&#1086;&#1074;&#1077;&#1090;&#1089;&#1082;&#1086;&#1077; &#1087;&#1086;&#1089;&#1086;&#1083;&#1100;&#1089;&#1090;&#1074;&#1086;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1083;: <b>&laquo;&#1050;&#1089;&#1090;&#1072;&#1090;&#1080;, &#1072;&#1084;&#1077;&#1088;&#1080;&#1082;&#1072;&#1085;&#1094;&#1099; &#1079;&#1085;&#1072;&#1102;&#1090; &#1074;&#1072;&#1096; &#1096;&#1080;&#1092;&#1088;&raquo;</b>.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1056;&#1086;&#1084;&#1072;&#1085;&#1086;&#1074;: <b>&laquo;&#1052;&#1077;&#1085;&#1103; &#1101;&#1090;&#1086; &#1085;&#1080;&#1095;&#1091;&#1090;&#1100; &#1085;&#1077; &#1091;&#1076;&#1080;&#1074;&#1083;&#1103;&#1077;&#1090;. &#1052;&#1099; &#1091;&#1078;&#1077; &#1074; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1079;&#1085;&#1072;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1079;&#1085;&#1072;&#1102;&#1090; &#1085;&#1072;&#1096; &#1096;&#1080;&#1092;&#1088;, &#1080; &#1074;&#1077;&#1076;&#1077;&#1084; &#1089;&#1077;&#1073;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; - &#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1074;&#1080;&#1076;, &#1073;&#1091;&#1076;&#1090;&#1086; &#1080;&#1084; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1085;&#1072;&#1089; &#1086;&#1076;&#1091;&#1088;&#1072;&#1095;&#1080;&#1090;&#1100;&raquo;</b>.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1083; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1072;&#1084;&#1077;&#1088;&#1080;&#1082;&#1072;&#1085;&#1089;&#1082;&#1086;&#1077; &#1087;&#1086;&#1089;&#1086;&#1083;&#1100;&#1089;&#1090;&#1074;&#1086;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1052;&#1086;&#1091;&#1083;&#1079;&#1091;&#1086;&#1088;&#1090;: <b>&laquo;&#1063;&#1090;&#1086;? &#1042;&#1099; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1099;?&raquo;</b>.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1083;: <b>&laquo;&#1040;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086;&raquo;</b>.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1052;&#1086;&#1091;&#1083;&#1079;&#1091;&#1086;&#1088;&#1090;: <b>&laquo;&#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1102; &#1074;&#1072;&#1089;! &#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1102;! &#1071; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1079;&#1072;&#1073;&#1091;&#1076;&#1091; &#1086;&#1073; &#1091;&#1089;&#1083;&#1091;&#1075;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1085;&#1072;&#1084; &#1086;&#1082;&#1072;&#1079;&#1072;&#1083;&#1080;&raquo;</b>.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1083;: <b>&laquo;&#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1079;&#1085;&#1072;&#1083;&#1080;?&raquo;</b>.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1069;&#1090;&#1072; &#1089;&#1094;&#1077;&#1085;&#1072; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; &#1093;&#1086;&#1076; &#1088;&#1072;&#1079;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1074;&#1077;&#1076;&#1095;&#1080;&#1082;&#1072; - &#1072;&#1085;&#1072;&#1083;&#1080;&#1090;&#1080;&#1082;&#1072;: <b>&laquo;&#1054;&#1085; &#1079;&#1085;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1103; &#1079;&#1085;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1079;&#1085;&#1072;&#1077;&#1090; ...&raquo;</b>.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1055;&#1088;&#1077;&#1082;&#1088;&#1072;&#1089;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1083; &#1101;&#1090;&#1086;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1080;&#1103; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1080;&#1081; &#1087;&#1086;&#1101;&#1090; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086;&#1075;&#1086; &#1074;&#1077;&#1082;&#1072; &#1050;&#1086;&#1074;&#1077;&#1085;&#1090;&#1088;&#1080; &#1055;&#1072;&#1090;&#1084;&#1086;&#1088;. &#1057;&#1085;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1077;&#1074;&#1091;&#1096;&#1082;&#1080; &#1082; &#1076;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072;&#1084; &#1077;&#1077; &#1087;&#1086;&#1082;&#1083;&#1086;&#1085;&#1085;&#1080;&#1082;&#1072; &#1086;&#1085; &#1086;&#1087;&#1080;&#1089;&#1072;&#1083; &#1090;&#1072;&#1082;:</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1054;&#1085; &#1076;&#1091;&#1084;&#1072;&#1083;, &#1095;&#1090;&#1086; &#1091;&#1089;&#1085;&#1091;&#1083;&#1072; &#1103; &#1048; &#1074;&#1089;&#1077; &#1074;&#1086; &#1089;&#1085;&#1077; &#1089;&#1090;&#1077;&#1088;&#1087;&#1083;&#1102;, &#1048;&#1083;&#1100; &#1076;&#1091;&#1084;&#1072;&#1083;, &#1095;&#1090;&#1086; &#1103; &#1076;&#1091;&#1084;&#1072;&#1102;, &#1063;&#1090;&#1086; &#1076;&#1091;&#1084;&#1072;&#1083; &#1086;&#1085;: &#1071; &#1089;&#1087;&#1083;&#1102;!</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1069;&#1090;&#1086;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1096;&#1072;&#1093;&#1084;&#1072;&#1090;&#1080;&#1089;&#1090;&#1072; - &#1083;&#1086;&#1075;&#1080;&#1082;&#1072;.</p>
<br><br>
<hr>
<br>
</body> 
</html>