<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
<head> <meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />

<title>История развития криптографии. Развитие шифров </title>

<style type="text/css">
<!--
.стиль1 {
	font-size: 10mm;
	font-weight: bold;
	font-family: Tahoma, Arial, Helvetica, sans-serif;
}
.стиль2 {font-family: Tahoma, Arial, Helvetica, sans-serif}
.стиль3 {
	font-size: 12pt;
	font-family: Tahoma, Arial, Helvetica, sans-serif;
}
-->
</style>
</head>
<a href=index.html><img src=" o.jpg" align="right" > </a>
<br><br><br><br>
<p align="center">  <b>  <BODY text=" " link="000000" vlink="000000" alink="878787"> <font color= "000000" face= "Tahoma" size="5" > |<a href=shifri.html> Развитие шифров </a>    |    <a href=prib.html> Изобретения  </a>   |   <a href=ist.html>Немного о... </a>| <a href=index.html>На главную..>></a>|</b></b> 
</font> </body> 
</p>
<hr>
<br>

<body background="фонег.jpg"  text="000000" bgcolor=" "> 
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1056;&#1077;&#1096;&#1105;&#1090;&#1082;&#1072; &#1050;&#1072;&#1088;&#1076;&#1072;&#1085;&#1086;</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1056;&#1077;&#1096;&#1077;&#1090;&#1082;&#1072; &#1050;&#1072;&#1088;&#1076;&#1072;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1072; &#1080;&#1079; &#1083;&#1080;&#1089;&#1090;&#1072; &#1082;&#1072;&#1088;&#1090;&#1086;&#1085;&#1072; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1075;&#1072;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1080;&#1083;&#1080; &#1078;&#1077; &#1080;&#1079; &#1090;&#1086;&#1085;&#1082;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1072;&#1083;&#1083;&#1072;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1083;&#1080;&#1085;&#1080;&#1080; &#1087;&#1080;&#1089;&#1100;&#1084;&#1072;, &#1073;&#1091;&#1084;&#1072;&#1075;&#1091; &#1088;&#1072;&#1079;&#1083;&#1080;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1102;&#1090;, &#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1101;&#1090;&#1080;&#1084;&#1080; &#1083;&#1080;&#1085;&#1080;&#1103;&#1084;&#1080; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1102;&#1090; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1072;&#1083;&#1099; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1076;&#1083;&#1080;&#1085;&#1099;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1064;&#1080;&#1092;&#1088;&#1072;&#1090;&#1086;&#1088; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1091; &#1085;&#1072; &#1083;&#1080;&#1089;&#1090; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1080; &#1087;&#1080;&#1096;&#1077;&#1090; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1086;&#1090;&#1074;&#1077;&#1088;&#1089;&#1090;&#1080;&#1103;&#1093;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;, &#1089;&#1083;&#1086;&#1075; &#1080;&#1083;&#1080; &#1094;&#1077;&#1083;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086;. &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1093; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1072; &#1091;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; &#1087;&#1091;&#1089;&#1090;&#1099;&#1077; &#1084;&#1077;&#1089;&#1090;&#1072; &#1085;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1077; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1089;&#1090;&#1072;&#1083; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1058;&#1072;&#1082;&#1086;&#1077; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1090;&#1072;&#1083;&#1072;&#1085;&#1090;&#1072;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1059; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1090;&#1072;&#1082;&#1072;&#1103; &#1078;&#1077; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1072;. &#1050;&#1086;&#1087;&#1080;&#1080; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1080; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080;&#1079; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1076;&#1083;&#1103; &#1074;&#1079;&#1072;&#1080;&#1084;&#1085;&#1086;-&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1056;&#1077;&#1096;&#1077;&#1090;&#1082;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074; 4 &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; &mdash; &#1083;&#1080;&#1094;&#1086;&#1084; &#1074;&#1074;&#1077;&#1088;&#1093;, &#1083;&#1080;&#1094;&#1086;&#1084; &#1074;&#1085;&#1080;&#1079;, &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080; &#1074; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1086;&#1084; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;, &#1095;&#1090;&#1086; &#1074;&#1095;&#1077;&#1090;&#1074;&#1077;&#1088;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1081; &#1089;&#1077;&#1090;&#1082;&#1080;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2"><img src="file:///D|/&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;/CardanGrille.png" width="541" height="368"></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1056;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1085;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1097;&#1077;&#1077;&#1089;&#1103; &#1082; &#1076;&#1077;&#1083;&#1091; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1089;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086;. &#1053;&#1077;&#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1103;&#1079;&#1099;&#1082; &#1087;&#1088;&#1080;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1082; &#1089;&#1077;&#1073;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1080; &#1094;&#1077;&#1083;&#1100; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1080; &#1050;&#1072;&#1088;&#1076;&#1072;&#1085;&#1086;, &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1060;&#1088;&#1101;&#1085;&#1089;&#1080;&#1089;&#1091; &#1041;&#1101;&#1082;&#1086;&#1085;&#1091;, &mdash; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &laquo;&#1073;&#1077;&#1079; &#1087;&#1086;&#1076;&#1086;&#1079;&#1088;&#1077;&#1085;&#1080;&#1081;&raquo;. &#1053;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1050;&#1072;&#1088;&#1076;&#1072;&#1085;&#1086; &#1089;&#1090;&#1086;&#1103;&#1083;&#1072; &#1084;&#1077;&#1085;&#1077;&#1077; &#1090;&#1088;&#1091;&#1076;&#1085;&#1072;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1088;&#1092;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1103; 16 &#1074;&#1077;&#1082;&#1072; &#1085;&#1077; &#1073;&#1099;&#1083;&#1072; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1072; &#1089;&#1090;&#1086;&#1083;&#1100; &#1078;&#1077;&#1089;&#1090;&#1082;&#1080;&#1084;&#1080; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1072;&#1084;&#1080; &#1080; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1076;&#1083;&#1103; &#1082;&#1072;&#1083;&#1083;&#1080;&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1081; &#1080; &#1091;&#1082;&#1088;&#1072;&#1096;&#1077;&#1085;&#1080;&#1081;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&#1060;&#1088;&#1101;&#1085;&#1089;&#1080;&#1089; &#1041;&#1101;&#1082;&#1086;&#1085; &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1083; 3 &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1080; &#1050;&#1072;&#1088;&#1076;&#1072;&#1085;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;:<br>
1)&#1052;&#1077;&#1090;&#1086;&#1076; &#1083;&#1077;&#1075;&#1086;&#1082; &#1074; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080;<br>
2)&#1056;&#1072;&#1089;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1076;&#1083;&#1103; &#1079;&#1083;&#1086;&#1091;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1080;&#1082;&#1072; &mdash; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077;&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084;&#1072;&#1103;<br>
3)&#1047;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1077; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1086;&#1076; &#1087;&#1086;&#1076;&#1086;&#1079;&#1088;&#1077;&#1085;&#1080;&#1077;</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2"><strong>&#1053;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1080;</strong></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;3">&#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1103; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1085;&#1099;&#1093; &#1085;&#1072;&#1074;&#1099;&#1082;&#1086;&#1074;. &#1053;&#1086; &#1089;&#1072;&#1084;&#1086;&#1077; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1083;&#1102;&#1073;&#1086;&#1081; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1090;&#1077;&#1088;&#1103;&#1085;, &#1091;&#1082;&#1088;&#1072;&#1076;&#1077;&#1085; &#1080;&#1083;&#1080; &#1082;&#1086;&#1085;&#1092;&#1080;&#1089;&#1082;&#1086;&#1074;&#1072;&#1085;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1090;&#1100; &#1086;&#1076;&#1085;&#1091; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1091; &mdash; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1090;&#1100; &#1074;&#1089;&#1102; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;&#1085;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1087;&#1080;&#1089;&#1082;&#1091;, &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1074;&#1096;&#1091;&#1102;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1090;&#1086;&#1081; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1080;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;3">&#1056;&#1077;&#1096;&#1077;&#1090;&#1082;&#1072; &#1050;&#1072;&#1088;&#1076;&#1072;&#1085;&#1086; &#1074; &#1089;&#1074;&#1086;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1074;&#1080;&#1076;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1086;&#1084; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086;, &#1085;&#1077;&#1078;&#1077;&#1083;&#1080; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1072;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1056;&#1091;&#1082;&#1086;&#1087;&#1080;&#1089;&#1100; &#1042;&#1086;&#1081;&#1085;&#1080;&#1095;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1075;&#1083;&#1072; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1076;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1082;&#1086;&#1081; XVI &#1074;&#1077;&#1082;&#1072;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1073;&#1099;&#1083;&#1072; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1080; &#1050;&#1072;&#1088;&#1076;&#1072;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1086;&#1081; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1089;&#1077;&#1074;&#1076;&#1086;-&#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1091;&#1102; &#1073;&#1077;&#1089;&#1089;&#1084;&#1099;&#1089;&#1083;&#1080;&#1094;&#1091; &#1080;&#1079; &#1088;&#1072;&#1085;&#1077;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1074;&#1096;&#1077;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;.</p>
<p class="&#1089;&#1090;&#1080;&#1083;&#1100;2">&nbsp; </p>
<br><br>
<hr>
<br>
  </body> 
</html>