<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
<head> <meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />

<title>История развития криптографии. Развитие шифров </title>
<style type="text/css">
<!--
.стиль8 {font-family: tahoma, Arial, Helvetica, sans-serif}
-->
</style>
</head>
<a href=index.html><img src=" o.jpg" align="right" > </a>
<br><br><br><br>
<p align="center">  <b>  <BODY text=" " link="000000" vlink="000000" alink="878787"> <font color= "000000" face= "Tahoma" size="5" > |<a href=shifri.html> Развитие шифров </a>    |    <a href=prib.html> Изобретения  </a>   |   <a href=ist.html>Немного о... </a>| <a href=index.html>На главную..>></a>|</b></b> 
</font> </body> 
</p>
<hr>
<br>

<body background="фонег.jpg"  text="000000" bgcolor=" "> 
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8"><strong>&#1064;&#1080;&#1092;&#1088;&#1099; &#1050;&#1077;&#1087;&#1083;&#1077;&#1088;&#1072; &#1080; &#1043;&#1072;&#1083;&#1080;&#1083;&#1077;&#1103; </strong></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1040;&#1089;&#1090;&#1088;&#1086;&#1085;&#1086;&#1084;&#1099;, &#1074;&#1089;&#1083;&#1077;&#1076; &#1079;&#1072; &#1043;&#1072;&#1083;&#1080;&#1083;&#1077;&#1077;&#1084; &#1080; &#1050;&#1077;&#1087;&#1083;&#1077;&#1088;&#1086;&#1084;, &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;. </p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1058;&#1072;&#1082; &#1050;&#1088;&#1080;&#1089;&#1090;&#1080;&#1072;&#1085; &#1043;&#1102;&#1081;&#1075;&#1077;&#1085;&#1089;, &#1086;&#1090;&#1082;&#1088;&#1099;&#1074; &#1082;&#1086;&#1083;&#1100;&#1094;&#1072; &#1057;&#1072;&#1090;&#1091;&#1088;&#1085;&#1072;, &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1083; &#1092;&#1088;&#1072;&#1079;&#1091;: <strong>&laquo;Annulo cingiur tenni piano, nusquem cohaerente, ad ecliptican inclinato&raquo;</strong> (&laquo;&#1054;&#1085; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085; &#1090;&#1086;&#1085;&#1082;&#1080;&#1084; &#1087;&#1083;&#1086;&#1089;&#1082;&#1080;&#1084; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086;&#1084;, &#1085;&#1080;&#1075;&#1076;&#1077; &#1085;&#1077; &#1082;&#1072;&#1089;&#1072;&#1102;&#1097;&#1080;&#1084;&#1089;&#1103;, &#1085;&#1072;&#1082;&#1083;&#1086;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084; &#1082; &#1101;&#1082;&#1083;&#1080;&#1087;&#1090;&#1080;&#1082;&#1077;&raquo;) &#1074; &#1074;&#1080;&#1076;&#1077; &#1088;&#1103;&#1076;&#1072; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090; &#1073;&#1091;&#1082;&#1074;:</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8"><strong>7&#1040;, 5&#1057;, ID, 5&#1045;, 1G, 1&#1053;, 71, 4L, 2&#1052;, 9N, 40, 2&#1056;, 1Q, 2R, IS, 5T, 5U.</strong></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8"><img src="file:///D|/&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;/&#1082;&#1077;&#1087;&#1083;&#1077;&#1088;.gif" width="265" height="308" border="2" align="left"></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1047;&#1072;&#1084;&#1077;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1043;&#1072;&#1083;&#1080;&#1083;&#1077;&#1081; &#1074; &#1089;&#1074;&#1086;&#1077;&#1084; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1087;&#1099;&#1090;&#1072;&#1083;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1073;&#1091;&#1082;&#1074;&#1099; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1072;&#1103; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1080;&#1084;&#1077;&#1083;&#1072; &laquo;&#1086;&#1089;&#1084;&#1099;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081;&raquo; &#1074;&#1080;&#1076; (&#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1086;&#1084;), &#1090;&#1086; &#1077;&#1075;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;: &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1099; &#1073;&#1091;&#1082;&#1074; &#1074; &#1079;&#1072;&#1097;&#1080;&#1097;&#1072;&#1077;&#1084;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1058;&#1072;&#1082;, &#1092;&#1088;&#1072;&#1079;&#1091; <strong>&laquo;&#1042;&#1057;&#1058;&#1056;&#1045;&#1063;&#1040;&#1049; &#1047;&#1040;&#1042;&#1058;&#1056;&#1040; &#1048; &#1050;&#1054;&#1051;&#1070;&raquo; </strong>&#1043;&#1072;&#1083;&#1083;&#1080;&#1083;&#1077;&#1081; &#1084;&#1086;&#1075; &#1073;&#1099; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;: <strong>&laquo;&#1047;&#1040;&#1042;&#1058;&#1056;&#1040;&#1050; &#1048; &#1063;&#1040;&#1049; &#1070;&#1056;&#1045; &#1042; &#1057;&#1058;&#1054;&#1051;&raquo;</strong>. &#1045;&#1075;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1073;&#1099; &#1090;&#1072;&#1082;&#1080;&#1077; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1099;&#1077; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;:</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8"><strong>&laquo;&#1040;&#1040;&#1040;&#1042;&#1042;&#1045;&#1047;&#1048;&#1049;&#1050;&#1051;&#1054;&#1056;&#1056;&#1057;&#1058;&#1058;&#1063;&#1070;&raquo;</strong></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8"><strong>&laquo;&#1047;&#1040;, 2&#1042;, IE, 13, 1&#1048;, 1&#1049;, 1&#1050;, 1&#1051;, &#1070;, 2&#1056;, 1&#1057;, 2&#1058;, 14, 1&#1070;&raquo;</strong></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8"><strong>&laquo;&#1040;3, &#1042;2, &#1045;1, &#1047;1, &#1048;1, &#1049;, &#1050;1, &#1051;1, &#1054;1, &#1056;2, &#1057;1, &#1058;2, &#1063;1, &#1070;1&raquo;</strong></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1040;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1096;&#1080;&#1092;&#1088;&#1072; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;. &#1061;&#1086;&#1090;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1087;&#1086; &#1089;&#1091;&#1090;&#1080; &#1089;&#1074;&#1086;&#1077;&#1081; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;. &#1048; &#1076;&#1077;&#1083;&#1086; &#1079;&#1076;&#1077;&#1089;&#1100; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1085;&#1077;&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1040;&#1074;&#1090;&#1086;&#1088; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1086;&#1090;&#1089;&#1099;&#1083;&#1072;&#1103; &#1077;&#1077; &#1089;&#1074;&#1086;&#1080;&#1084; &#1082;&#1086;&#1088;&#1088;&#1077;&#1089;&#1087;&#1086;&#1085;&#1076;&#1077;&#1085;&#1090;&#1072;&#1084;, &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083; &#1077;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1086;&#1085; &#1089;&#1095;&#1080;&#1090;&#1072;&#1083; &#1077;&#1075;&#1086; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084;. &#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1087;&#1086; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1072;&#1084; &#1073;&#1091;&#1082;&#1074; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1089;&#1083;&#1086;&#1078;&#1085;&#1072;&#1103;. &#1062;&#1077;&#1083;&#1100; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1074; &#1079;&#1072;&#1097;&#1080;&#1090;&#1077; &laquo;&#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1072;&#1074;&#1072;&raquo; &#1073;&#1077;&#1079; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1086;&#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1080;&#1093; &laquo;&#1077;&#1088;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093;&raquo; &#1080;&#1076;&#1077;&#1081;. </p>

<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;8">&#1047;&#1072;&#1087;&#1080;&#1089;&#1072;&#1074; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1089;&#1074;&#1086;&#1077;&#1084; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080;, &#1072;&#1074;&#1090;&#1086;&#1088; &#1087;&#1088;&#1103;&#1090;&#1072;&#1083; &#1101;&#1090;&#1091; &#1073;&#1091;&#1084;&#1072;&#1075;&#1091; &#1074; &#1085;&#1072;&#1076;&#1077;&#1078;&#1085;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077;, &#1072; &#1089;&#1074;&#1086;&#1077;&#1084;&#1091; &#1082;&#1086;&#1088;&#1088;&#1077;&#1089;&#1087;&#1086;&#1085;&#1076;&#1077;&#1085;&#1090;&#1091; &#1086;&#1090;&#1089;&#1099;&#1083;&#1072;&#1083; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;. &#1042; &#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1086;&#1085; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1083; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1077;&#1084;&#1091; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1091;&#1076;&#1080;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1084;&#1099;&#1089;&#1083; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081;. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1072; &#1072;&#1074;&#1090;&#1086;&#1088; &#1084;&#1086;&#1075; &#1087;&#1088;&#1077;&#1076;&#1098;&#1103;&#1074;&#1080;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;. &#1045;&#1075;&#1086; &#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1072;&#1083;&#1072;&#1089;&#1100; &#1088;&#1072;&#1085;&#1077;&#1077; &#1074;&#1099;&#1089;&#1083;&#1072;&#1085;&#1085;&#1086;&#1081; &#1072;&#1085;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081;. &#1069;&#1090;&#1072; &#1080;&#1076;&#1077;&#1103; &#1074; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086;&#1084; &#1074;&#1080;&#1076;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1085;&#1072;&#1096;&#1080; &#1076;&#1085;&#1080;. &#1044;&#1083;&#1103; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076;&#1083;&#1080;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103; &#1077;&#1075;&#1086; &#1087;&#1086;&#1076;&#1084;&#1077;&#1085;&#1099; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1088;&#1103;&#1076; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1073;&#1091;&#1082;&#1074;, &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1053;&#1072; &#1087;&#1088;&#1080;&#1077;&#1084;&#1085;&#1086;&#1084; &#1082;&#1086;&#1085;&#1094;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072;.</p>
<br><br>
<hr>
<br>
</body> 
</html>

