<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
<head> <meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />

<title>История развития криптографии. Развитие шифров </title>
<style type="text/css">
<!--
.стиль1 {
	font-size: 14pt;
	font-weight: bold;
	font-family: Tahoma, Arial, Helvetica, sans-serif;
}
.стиль2 {
	font-family: Tahoma, Arial, Helvetica, sans-serif;
	font-size: 14pt;
}
.стиль4 {font-family: Tahoma, Arial, Helvetica, sans-serif; font-weight: bold;}
.стиль5 {font-size: 14pt}
.стиль6 {font-family: Tahoma, Arial, Helvetica, sans-serif}
-->
</style>
</head>


<a href=index.html><img src=" o.jpg" align="right" > </a>
<br><br><br><br>
<p align="center">  <font color="000000" face= "tahoma" size="5" >
 <b> <BODY text="# " link="000000" vlink="000000" alink="878787"> <font color= "000000" face= "Tahoma" size="5" > |<a href=shifri.html> Развитие шифров </a>    |    <a href=prib.html> Изобретения  </a>   |   <a href=ist.html>Немного о... </a>| <a href=index.html>На главную..>></a>|</b></b> 
</font> </body> 
</p>
<hr>
<br>

<body background="фонег.jpg" text="000000" bgcolor="# ">
<div align="center">
  <p><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1055;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1085;&#1072;&#1103; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1072;</span></p>
  <p>
      <span class="&#1089;&#1090;&#1080;&#1083;&#1100;1"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;2"><img src=" карда.jpg" width="305" height="273" align="middle"></span></span></p>
</div>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2"><img src=" кард.gif" width="307" height="288" align="left">&#1058;&#1077;&#1082;&#1089;&#1090; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1082;&#1072;&#1082; &#1085;&#1077;&#1074;&#1080;&#1085;&#1085;&#1086;&#1077; &#1083;&#1102;&#1073;&#1086;&#1074;&#1085;&#1086;&#1077; &#1087;&#1080;&#1089;&#1100;&#1084;&#1086;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090; &#1056;&#1080;&#1096;&#1077;&#1083;&#1100;&#1077;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1079;&#1083;&#1086;&#1074;&#1077;&#1097;&#1091;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;: <strong>&laquo;YOU KILL AT ONCE&raquo;</strong>.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;2"> &#1050;&#1072;&#1088;&#1076;&#1072;&#1085;&#1086; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1080;&#1090; &#1080;&#1076;&#1077;&#1103; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1085;&#1086;&#1081; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1080; &#1082;&#1072;&#1082; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1048;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1072;&#1103; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1083;&#1072; &#1089;&#1086;&#1073;&#1086;&#1081; &#1083;&#1080;&#1089;&#1090; &#1080;&#1079; &#1090;&#1074;&#1077;&#1088;&#1076;&#1086;&#1075;&#1086; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1095;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1072;&#1083;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1099; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1099;&#1077; &#1074;&#1099;&#1088;&#1077;&#1079;&#1099; &#1074;&#1099;&#1089;&#1086;&#1090;&#1086;&#1081; &#1076;&#1083;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1080; &#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1086;&#1081; &#1076;&#1083;&#1080;&#1085;&#1099;. &#1053;&#1072;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1103; &#1101;&#1090;&#1091; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1091; &#1085;&#1072; &#1083;&#1080;&#1089;&#1090; &#1087;&#1080;&#1089;&#1095;&#1077;&#1081; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1074; &#1074;&#1099;&#1088;&#1077;&#1079;&#1099; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1089;&#1085;&#1103;&#1074; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1091;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1086;&#1089;&#1090;&#1072;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1077; &#1084;&#1077;&#1089;&#1090;&#1072; &#1085;&#1072; &#1083;&#1080;&#1089;&#1090;&#1077; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1085;&#1077;&#1082;&#1080;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084;, &#1084;&#1072;&#1089;&#1082;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1084; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;. &#1055;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1089;&#1090;&#1077;&#1075;&#1072;&#1085;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; &#1084;&#1072;&#1089;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1099;&#1077; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1083;&#1080;&#1094;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1082;&#1072;&#1088;&#1076;&#1080;&#1085;&#1072;&#1083; &#1056;&#1080;&#1096;&#1077;&#1083;&#1100;&#1077; &#1074;&#1086; &#1060;&#1088;&#1072;&#1085;&#1094;&#1080;&#1080; &#1080; &#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081; &#1076;&#1080;&#1087;&#1083;&#1086;&#1084;&#1072;&#1090; &#1080; &#1087;&#1080;&#1089;&#1072;&#1090;&#1077;&#1083;&#1100; &#1040;. &#1043;&#1088;&#1080;&#1073;&#1086;&#1077;&#1076;&#1086;&#1074;. &#1058;&#1072;&#1082;, &#1056;&#1080;&#1096;&#1077;&#1083;&#1100;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; 7&times;10. &#1044;&#1083;&#1103; &#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;. &#1055;&#1088;&#1086;&#1088;&#1077;&#1079;&#1080; &#1090;&#1088;&#1072;&#1092;&#1072;&#1088;&#1077;&#1090;&#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1083;&#1080;&#1089;&#1100; &#1074; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103;&#1093;: (1, 8), (2, 9), (3, 6), (4, 5), (4, 6). (5, 1), (5, 6), (5, 7), (5, 9), (6, 2), (6, 10), (7, 9), (7, 10).</p>


<br><br><br>
 <p align="center"> 
 <font  face= "Tahoma" size="6"  > <a href="ришелье.swf" title="Проверь себя" target="_blank">Проверь себя</a> </font>
<br>
</p>
<hr>
<br>
  </body> 
</html>