<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd"> 
<html>
<head> <meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />

<title>История развития криптографии. Развитие шифров </title>
<style type="text/css">
<!--
.стиль6 {
	font-size: large;
	font-weight: bold;
	font-family: Tahoma, Arial, Helvetica, sans-serif;
}
.стиль7 {
	font-size: medium;
	font-family: Tahoma, Arial, Helvetica, sans-serif;
}
-->
</style>
</head>
<a href=index.html><img src=" o.jpg" align="right" > </a>
<br><br><br><br>
<p align="center">  <b>  <BODY text=" " link="000000" vlink="000000" alink="878787"> <font color= "000000" face= "Tahoma" size="5" > |<a href=shifri.html> Развитие шифров </a>    |    <a href=prib.html> Изобретения  </a>   |   <a href=ist.html>Немного о... </a>| <a href=index.html>На главную..>></a>|</b></b> 
</font> </body> 
</p>
<hr>
<br>

<body background="фонег.jpg"  text="000000" bgcolor=" "> 
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;6">&#1064;&#1080;&#1092;&#1088; &#1060;&#1072;&#1083;&#1100;&#1082;&#1086;&#1085;&#1077;&#1088;&#1072;</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7">&#1042; XVII &#1074;&#1077;&#1082;&#1077; &#1044;&#1078;. &#1060;&#1072;&#1083;&#1100;&#1082;&#1086;&#1085;&#1077;&#1088; (&#1040;&#1085;&#1075;&#1083;&#1080;&#1103;) &#1074;&#1099;&#1087;&#1091;&#1089;&#1090;&#1080;&#1083; &#1082;&#1085;&#1080;&#1075;&#1091; &laquo;&#1056;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;&raquo;. &#1042; &#1085;&#1077;&#1081; &#1080;&#1079;&#1083;&#1072;&#1075;&#1072;&#1083;&#1080;&#1089;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1077;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1042; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1086;&#1085; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1080;&#1083; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1073;&#1086;&#1088; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1089;&#1083;&#1086;&#1074; &#1087;&#1086; &#1080;&#1093; &#1076;&#1083;&#1080;&#1085;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100; &#1088;&#1072;&#1079;&#1073;&#1080;&#1074;&#1082;&#1072; &#1085;&#1072; &#1089;&#1083;&#1086;&#1074;&#1072;. </p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7">&#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1072;&#1103; &#1060;&#1072;&#1083;&#1100;&#1082;&#1086;&#1085;&#1077;&#1088;&#1086;&#1084; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1097;&#1072;&#1103; &#1076;&#1074;&#1072; &#1096;&#1080;&#1092;&#1088;&#1072;: &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1080; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7">&#1055;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1077;&#1084; &#1083;&#1086;&#1079;&#1091;&#1085;&#1075;: <strong>&laquo;&#1051;&#1048;&#1051;&#1048;&#1055;&#1059;&#1058;&raquo;</strong>. &#1055;&#1086; &#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1086;&#1079;&#1091;&#1085;&#1075;&#1091; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088;&#1085;&#1086;&#1081; &#1088;&#1103;&#1076; &#1087;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1091;: &#1073;&#1091;&#1082;&#1074;&#1099; &#1083;&#1086;&#1079;&#1091;&#1085;&#1075;&#1072; &#1085;&#1091;&#1084;&#1077;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077; &#1073;&#1091;&#1082;&#1074;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072;. &#1059;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1083;&#1086;&#1079;&#1091;&#1085;&#1075;&#1091; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088;&#1085;&#1086;&#1081; &#1088;&#1103;&#1076;:<strong> 3 1 4 2 5 7 6.</strong><br>
</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7"> <strong>&#1040; &#1041; &#1042; &#1043; &#1044; &#1045; &#1045; &#1046; &#1047; &#1048; &#1049; &#1050; &#1051; &#1052; &#1053; &#1054; &#1055; &#1056; &#1057; &#1058; &#1059; &#1060; &#1061; &#1062; &#1063; &#1064; &#1065; &#1067; &#1066; &#1068; &#1069; &#1070; &#1071; 1 3 5 6 7 2 4 </strong><br>
</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7"> &#1047;&#1072;&#1096;&#1080;&#1092;&#1088;&#1091;&#1077;&#1084; &#1092;&#1088;&#1072;&#1079;&#1091; <strong>&laquo;&#1064;&#1048;&#1060;&#1056; &#1042;&#1045;&#1056;&#1058;&#1048;&#1050;&#1040;&#1051;&#1068;&#1053;&#1054;&#1049; &#1055;&#1045;&#1056;&#1045;&#1057;&#1058;&#1040;&#1053;&#1054;&#1042;&#1050;&#1048;&raquo;</strong>; &#1087;&#1088;&#1080; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1092;&#1088;&#1072;&#1079;&#1072; &#1074;&#1099;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; 4x7 &#1073;&#1077;&#1079; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;&#1080;. &#1057;&#1090;&#1086;&#1083;&#1073;&#1094;&#1099; &#1086;&#1090;&#1084;&#1077;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1094;&#1080;&#1092;&#1088;&#1072;&#1084;&#1080; &#1085;&#1086;&#1084;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1088;&#1103;&#1076;&#1072;:<br>
</p>
<table width="400" border="3" face="tahoma" align="center" size="5">
  <tr>
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">3</span></th>
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">1</span></th>
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">4</span></th>
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">2</span></th>
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">5</span></th>
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">7</span></th>
    <th scope="col"><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">6</span></th>
  </tr>
  <tr>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1096;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1080;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1092;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1088;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1074;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1077;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1088;</span></td>
  </tr>
  <tr>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1090;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1080;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1082;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1072;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1083;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1100;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1085;</span></td>
  </tr>
  <tr>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1086;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1081;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1087;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1077;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1088;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1077;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1089;</span></td>
  </tr>
  <tr>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1090;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1072;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1085;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1086;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1074;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1082;</span></td>
    <td><span class="&#1089;&#1090;&#1080;&#1083;&#1100;1">&#1080;</span></td>
  </tr>
</table>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7">&#1055;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1099;&#1081; &#1096;&#1080;&#1092;&#1088;&#1090;&#1077;&#1082;&#1089;&#1090; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1090;&#1077;&#1084; &#1074;&#1099;&#1087;&#1080;&#1089;&#1082;&#1080; &#1073;&#1091;&#1082;&#1074; &#1087;&#1086; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;&#1084;, &#1072; &#1089;&#1072;&#1084;&#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090; &#1076;&#1088;&#1091;&#1075; &#1079;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1086;&#1084; &#1085;&#1086;&#1084;&#1077;&#1088;&#1085;&#1099;&#1084; &#1088;&#1103;&#1076;&#1086;&#1084;. </p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7">&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084;:</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7"><strong>&#1048;&#1048;&#1049;&#1040;&#1056;&#1040;&#1045;&#1054;&#1064;&#1058;&#1054;&#1058;&#1060;&#1050;&#1055;&#1053;&#1042;&#1051;&#1056;&#1042;&#1056;&#1053;&#1057;&#1048;&#1045;&#1068;&#1045;&#1050;</strong></p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7">&#1047;&#1072;&#1090;&#1077;&#1084; &#1101;&#1090;&#1086;&#1090; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1099;&#1081; &#1096;&#1080;&#1092;&#1088;&#1090;&#1077;&#1082;&#1089;&#1090; &#1096;&#1080;&#1092;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1090;&#1086;&#1088;&#1080;&#1095;&#1085;&#1086; &#1096;&#1080;&#1092;&#1088;&#1086;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1096;&#1080;&#1092;&#1088;&#1090;&#1077;&#1082;&#1089;&#1090;.</p>
<p align="center" class="&#1089;&#1090;&#1080;&#1083;&#1100;7">&#1059;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1096;&#1080;&#1092;&#1088; &#1089; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1080; &#1074; &#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; XX &#1074;&#1077;&#1082;&#1072; &#1074; &#1043;&#1077;&#1088;&#1084;&#1072;&#1085;&#1080;&#1080;, &#1060;&#1088;&#1072;&#1085;&#1094;&#1080;&#1080;, &#1057;&#1057;&#1057;&#1056;, &#1071;&#1087;&#1086;&#1085;&#1080;&#1080; &#1080; &#1076;&#1088;. &#1089;&#1090;&#1088;&#1072;&#1085;&#1072;&#1093;.</p>
<br><br>
<p align="center"> 
 <font  face= "Tahoma" size="6"  > <a href="фальк.swf" title="Проверь себя" target="_blank">Проверь себя</a> </font>
<br>
</p>
<hr>
<br>
</body> 
</html>